
&НаСервере
Процедура А1БСП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	МассивОписаний = Новый Массив;
	Если А1Э_Общее.ЗначениеСвойства(Параметры, "ПриВходеВПрограмму") = Истина Тогда
		А1Э_Формы.ДобавитьОписаниеДекорации(МассивОписаний, "А1БСП_Предупреждение", "Закрытие этой формы без изменения пароля приведет к завершению работы системы!", , "ГруппаПароль", 
		А1Э_Структуры.Создать(
		"ЦветТекста", Новый Цвет(255,0,0),
		));
	КонецЕсли;
	А1Э_Формы.ДобавитьРеквизитыИЭлементы(ЭтаФорма, МассивОписаний);
КонецПроцедуры
