
&НаСервере
Процедура А1БСП_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	МассивОписаний = Новый Массив;
	Если А1Э_Общее.ЗначениеСвойства(Параметры, "ПриВходеВПрограмму") = Истина Тогда
		А1Э_Формы.ДобавитьОписаниеДекорации(МассивОписаний, "А1БСП_Предупреждение", "Закрытие этой формы без изменения пароля приведет к завершению работы системы!", , "ГруппаПароль", 
		А1Э_Структуры.Создать(
		"ЦветТекста", Новый Цвет(255,0,0),
		));
	КонецЕсли;
	А1Э_Формы.ДобавитьРеквизитыИЭлементы(ЭтаФорма, МассивОписаний);
КонецПроцедуры

&НаКлиенте
&Вместо("УстановитьПароль")
Процедура А1БСП_УстановитьПароль(Команда)
	Если Элементы.Найти("А1БСП_Предупреждение") <> Неопределено И НовыйПароль = "" Тогда 
		Сообщить("Новый пароль не может быть пустым! Придумайте пароль (желательно не менее 8 символов)!");
		Возврат;
	КонецЕсли;
	
	ПродолжитьВызов(Команда);
КонецПроцедуры
