//Добавляем типы, добавленные в расширениях. Пока что только для справочников и документов.
&Вместо("ОписаниеТипаВсеСсылки")
Функция А1БСП_ОписаниеТипаВсеСсылки()
	Результат = ПродолжитьВызов();
	МассивТиповСсылокРасширений = Новый Массив;
	Для Каждого Объект Из Метаданные.Справочники Цикл
		Если Объект.РасширениеКонфигурации() <> Неопределено Тогда
			МассивТиповСсылокРасширений.Добавить(Тип("СправочникСсылка." + Объект.Имя));
		КонецЕсли;
	КонецЦикла;
	Для Каждого Объект Из Метаданные.Документы Цикл
		Если Объект.РасширениеКонфигурации() <> Неопределено Тогда
			МассивТиповСсылокРасширений.Добавить(Тип("ДокументСсылка." + Объект.Имя));
		КонецЕсли;
	КонецЦикла;
	Результат = Новый ОписаниеТипов(Результат, МассивТиповСсылокРасширений); 
	Возврат Результат;
КонецФункции
