
&Вместо("ПриВыполненииСтандартныхПериодическихПроверок")
Процедура А1_ПриВыполненииСтандартныхПериодическихПроверок()
	Параметры = Новый Структура;
	
	ПодсистемаЦентрМониторингаСуществует = Ложь;
	Если ОбщегоНазначенияКлиент.ПодсистемаСуществует("СтандартныеПодсистемы.ЦентрМониторинга") Тогда
		ПодсистемаЦентрМониторингаСуществует = Истина;
		МодульЦентрМониторингаКлиентСлужебный = ОбщегоНазначенияКлиент.ОбщийМодуль("ЦентрМониторингаКлиентСлужебный");
		МодульЦентрМониторингаКлиентСлужебный.ПриВыполненииСтандартныхПериодическихПроверокНаКлиенте(Параметры);
	КонецЕсли;
	
	СтандартныеПодсистемыВызовСервера.ПриВыполненииСтандартныхПериодическихПроверокНаСервере(Параметры);
	
	Если ПодсистемаЦентрМониторингаСуществует Тогда
		МодульЦентрМониторингаКлиентСлужебный.ПослеВыполненияСтандартныхПериодическихПроверокНаКлиенте(Параметры);
	КонецЕсли;
	
	Контекст = Новый Структура("Параметры", Параметры);
	
	ОбработкаПродолжения = Новый ОписаниеОповещения(
		"ПриВыполненииСтандартныхПериодическихПроверокПодсистемаПользователи", ЭтотОбъект, Контекст);
	
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ОбработкаПродолжения", ОбработкаПродолжения);
	
	ВыполнитьОбработкуОповещения(ОбработкаПродолжения);

КонецПроцедуры