Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ПередЗаписью", Истина);
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ПередЗаписью(Объект, Отказ) Экспорт
		ЗаполнитьВладельцевДляОбъектовСМеханизмом(Объект);			
	КонецФункции
	
	Функция ЗаполнитьВладельцевДляОбъектовСМеханизмом(Объект)
		МетаданныеОбъекта = Объект.Метаданные();
		Для Каждого Реквизит Из МетаданныеОбъекта.Реквизиты Цикл
			Если НЕ СтрЗаканчиваетсяНа(Реквизит.Имя, "_Владелец") Тогда Продолжить; КонецЕсли;
			Значение = Объект[Реквизит.Имя];
			Если МетаданныеОбъекта.ТабличныеЧасти.ДополнительныеРеквизиты.Реквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
				Для Каждого Строка Из Объект.ДополнительныеРеквизиты Цикл
					Строка[Реквизит.Имя] = Значение;
				КонецЦикла;
			КонецЕсли;
				Если МетаданныеОбъекта.ТабличныеЧасти.ДополнительныеСведения.Реквизиты.Найти(Реквизит.Имя) <> Неопределено Тогда
				Для Каждого Строка Из Объект.ДополнительныеСведения Цикл
					Строка[Реквизит.Имя] = Значение;
				КонецЦикла;
			КонецЕсли;
		КонецЦикла;
	
	КонецФункции
	
#КонецЕсли
