
&НаСервере
&После("ПриСозданииНаСервере")
Процедура А1БСП_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьРасширенныйРежимДляОтчетовА1();
		
КонецПроцедуры

&НаСервере
Функция УстановитьРасширенныйРежимДляОтчетовА1() 
	Попытка
		Если ВРЕГ(Лев(А1Э_Строки.После(ЭтаФорма.КлючСохраненияПоложенияОкна, "."), 3)) <> "А1_" Тогда
			Возврат Неопределено;
		КонецЕсли;
		
		РасширенныйРежим = 1;
		
		ПараметрыОбновления = Новый Структура;
		ПараметрыОбновления.Вставить("ИмяСобытия", "РасширенныйРежимПриИзменении");
		ПараметрыОбновления.Вставить("КомпоновщикНастроекКД", Отчет.КомпоновщикНастроек);
		ПараметрыОбновления.Вставить("ОбновитьНастройкиВарианта", РасширенныйРежим = 1);
		ПараметрыОбновления.Вставить("СброситьПользовательскиеНастройки", РасширенныйРежим <> 1);
		
		ОбновитьФорму(ПараметрыОбновления);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
КонецФункции 
