
&НаСервере
&После("ПриСозданииНаСервере")
Процедура А1БСП_ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	УстановитьРасширенныйРежимДляОтчетовА1();
		
КонецПроцедуры

&НаСервере
Функция УстановитьРасширенныйРежимДляОтчетовА1() 
	Попытка
		Если ВРЕГ(Лев(А1Э_Строки.После(ЭтаФорма.КлючСохраненияПоложенияОкна, "."), 2)) <> "А1" Тогда Возврат Неопределено; КонецЕсли;
		
		РасширенныйРежим = 1;
		
		ПараметрыОбновления = Новый Структура;
		ПараметрыОбновления.Вставить("ИмяСобытия", "РасширенныйРежимПриИзменении");
		ПараметрыОбновления.Вставить("КомпоновщикНастроекКД", Отчет.КомпоновщикНастроек);
		ПараметрыОбновления.Вставить("ОбновитьНастройкиВарианта", РасширенныйРежим = 1);
		ПараметрыОбновления.Вставить("СброситьПользовательскиеНастройки", РасширенныйРежим <> 1);
		
		ОбновитьФорму(ПараметрыОбновления);
	Исключение
		ОписаниеОшибки = ОписаниеОшибки();
	КонецПопытки;
КонецФункции 

&НаКлиенте
&Вместо("ВыбратьПоле")
Процедура А1БСП_ВыбратьПоле(ИмяКоллекции, Обработчик, Поле, ИдентификаторУзлаНастроек)
	ПараметрыВыбора = Новый Структура;
	ПараметрыВыбора.Вставить("НастройкиОтчета", НастройкиОтчета);
	ПараметрыВыбора.Вставить("КомпоновщикНастроек", Отчет.КомпоновщикНастроек);
	ПараметрыВыбора.Вставить("Режим", ИмяКоллекции);
	ПараметрыВыбора.Вставить("ПолеКД", Поле);
	ПараметрыВыбора.Вставить("ИдентификаторЭлементаСтруктурыНастроек", 
		?(ИдентификаторУзлаНастроек = Неопределено, ИдентификаторЭлементаСтруктурыНастроек, ИдентификаторУзлаНастроек));
	
	ОткрытьФорму(
	    //А1Начало - новая форма из БСП некорректно отрабатывает в веб-клиенте для характеристик объектов метаданных из расширений.
		//"ХранилищеНастроек.ХранилищеВариантовОтчетов.Форма.ВыборПоляОтчета"
		"ХранилищеНастроек.ХранилищеВариантовОтчетов.Форма.А1БСП_ВыборПоляОтчета",
		//А1Окончание
		ПараметрыВыбора, ЭтотОбъект, УникальныйИдентификатор,,, Обработчик, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры
