Функция ДобавитьОписание(МассивОписаний, ИмяКомпонента, ПутьКДанным, ОсновноеПоле, ЭлементОсновногоПоля, РодительЭлемента = Неопределено, ПередЭлементом = Неопределено, Параметры = Неопределено, Действия = Неопределено) Экспорт
	Если А1Э_Структуры.Свойство(Параметры, "ИмяДополнительногоРеквизита") Тогда
		ИмяДополнительногоРеквизита = Параметры.ИмяДополнительногоРеквизита;
	Иначе
		ИмяДополнительногоРеквизита = ИмяКомпонента;
	КонецЕсли;
	
	ДопРеквизит = А1Э_ДопРеквизиты.Свойство(ИмяДополнительногоРеквизита);
		
	А1Э_УниверсальнаяФорма.ДобавитьОписаниеНастроекКомпонента(МассивОписаний, ИмяКомпонента, А1Э_Структуры.Создать(
	"ПутьКДанным", ПутьКДанным,
	"ОсновноеПоле", ОсновноеПоле,
	"ЭлементОсновногоПоля", ЭлементОсновногоПоля,
	"ЭтоДополнительноеСведение", ДопРеквизит.ЭтоДополнительноеСведение,
	"ИмяДополнительногоРеквизита", ИмяДополнительногоРеквизита  
	));
	РабочиеДействия = А1Э_Структуры.Скопировать(Действия);
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПриСозданииНаСервере");
	А1Э_УниверсальнаяФорма.ДобавитьОбработчикМодуляКДействиям(РабочиеДействия, ИмяМодуля(), "ФормаПослеЗаписиНаСервере");
	РабочиеПараметры = А1Э_Структуры.СкопироватьВШаблон(Параметры,
	"ТолькоПросмотр", Истина,
	"ИмяЭлемента", ИмяКомпонента,
	);
	
	А1Э_Формы.ДобавитьОписаниеРеквизитаИЭлемента(МассивОписаний, ИмяКомпонента, ДопРеквизит.ТипЗначения, ПутьКДанным, ДопРеквизит.Заголовок, РодительЭлемента, ПередЭлементом, РабочиеПараметры, РабочиеДействия);

КонецФункции 

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииНаСервере(ИмяКомпонента, Форма, Отказ, СтандартнаяОбработка) Экспорт
		ЗаполнитьДанные(ИмяКомпонента, Форма);		
	КонецФункции
	
	Функция ФормаПослеЗаписиНаСервере(ИмяКомпонента, Форма, ТекущийОбъект, ПараметрыЗаписи) Экспорт
		ЗаполнитьДанные(ИмяКомпонента, Форма);
	КонецФункции
	
	Функция ЗаполнитьДанные(ИмяКомпонента, Форма)
		Настройки = А1Э_УниверсальнаяФорма.НастройкиКомпонента(Форма, ИмяКомпонента);
		ЧастиПути = А1Э_Строки.Разделить(Настройки.ПутьКДанным, ".");
		Контейнер = А1Э_Иерархии.ЗначениеСвойства(Форма, ЧастиПути);
		ЗначенияОсновногоПоля = Новый Массив;
		ЭтоКолонка = ТипЗнч(Контейнер) = Тип("ДанныеФормыКоллекция");
		Если ЭтоКолонка И Контейнер.Количество() = 0 Тогда Возврат Неопределено КонецЕсли;
		
		Если ЭтоКолонка Тогда 
			Для Каждого Строка Из Контейнер Цикл
				ЗначенияОсновногоПоля.Добавить(Строка[Настройки.ОсновноеПоле]);
			КонецЦикла;
		Иначе
			ЗначенияОсновногоПоля.Добавить(Контейнер[Настройки.ОсновноеПоле]);
		КонецЕсли;
		
		ДанныеКомпонента = А1Э_ДопРеквизиты.ЗначениеСсылок(ЗначенияОсновногоПоля, Настройки.ИмяДополнительногоРеквизита, Настройки.ЭтоДополнительноеСведение);
		
		Если ЭтоКолонка Тогда
			Для Каждого Строка Из Контейнер Цикл
				Строка[ИмяКомпонента] = ДанныеКомпонента[Строка[Настройки.ОсновноеПоле]];
			КонецЦикла;
		Иначе
			Контейнер[ИмяКомпонента] = ДанныеКомпонента[Контейнер[Настройки.РеквизитСпецификации]];
		КонецЕсли;

	КонецФункции 
	
#КонецЕсли
 
Функция ИмяМодуля() Экспорт
	Возврат "А1БСП_КомпонентДополнительныйРеквизитПоля";
КонецФункции 