
&НаСервере 
Функция А1БСП_ИсправитьНаименованиеОтчетовА1(Строка)
	Если Строка = Неопределено Тогда Возврат Неопределено; КонецЕсли;
	Если НЕ СтрНачинаетсяС(Строка.ИмяОтчета, "А1") Тогда Возврат Неопределено; КонецЕсли;
	
	Строка.Наименование = Метаданные.Отчеты[Строка.ИмяОтчета].Синоним + " - " + Строка.Ссылка; 
КонецФункции 

&НаСервере
&После("ЗаполнитьПорядокВывода")
Процедура А1БСП_ЗаполнитьПорядокВывода(ПорядокВывода, СтрокаРодителя, СтрокаДерева, Рекурсия, ПараметрыЗаполнения)
	Попытка
		Для Каждого Строка Из ПорядокВывода Цикл
			А1БСП_ИсправитьНаименованиеОтчетовА1(Строка.Вариант);
		КонецЦикла;
	Исключение;
		//Адаптация типового обработчика - даже если что-то пошло не так - выполнение кода должно продолжаться.
	КонецПопытки;
КонецПроцедуры
	
