//Менеджером общего модуля считается он сам.
&Вместо("МенеджерОбъектаПоПолномуИмени")
Функция А1БСП_МенеджерОбъектаПоПолномуИмени(ПолноеИмя)
	ЧастиИмени = А1Э_Строки.ПередПосле(ПолноеИмя, ".");
	Попытка
		Если ВРег(ЧастиИмени.Перед) = "ОБЩИЙМОДУЛЬ" Тогда Возврат Вычислить(ЧастиИмени.После); КонецЕсли;
	Исключение;
		//Обработка исключения происходит в основной процедуре.
	КонецПопытки;
	Результат = ПродолжитьВызов(ПолноеИмя);
	Возврат Результат;
КонецФункции

//Не отрабатывает на объектах метаданных расширения. Для фикса рефакторим через А1Э.
&Вместо("ВидОбъектаПоСсылке")
Функция А1БСП_ВидОбъектаПоСсылке(Ссылка)
	Возврат А1Э_Строки.Перед(А1Э_Метаданные.ОбъектМетаданных(Ссылка).ПолноеИмя(), ".");
КонецФункции

//Не отрабатывает для объектов из расширений конфигурации, рефакторим через А1Э.
&Вместо("МенеджерОбъектаПоСсылке")
Функция А1БСП_МенеджерОбъектаПоСсылке(Ссылка)
	Возврат А1Э_Метаданные.МенеджерПоСсылке(Ссылка);
КонецФункции
