Функция ДобавитьМеханизмы(СписокМеханизмов) Экспорт
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ПодключаемыеКоманды");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ИнтерактивнаяСменаПароля");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ДополнительныеРеквизиты");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ОбъектыБезМеханизмов");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_Общее");
КонецФункции

Функция ДобавитьОбъекты(СписокОбъектов) Экспорт
	А1Э_Механизмы.Подключить(СписокОбъектов, А1Э_Механизмы.Адресация__БезОбъектов(), "А1БСП_ИнтерактивнаяСменаПароля");
	А1Э_Механизмы.Подключить(СписокОбъектов, А1Э_Механизмы.Адресация__БезОбъектов(), "А1БСП_ОбъектыБезМеханизмов");
	А1Э_Механизмы.Подключить(СписокОбъектов, А1Э_Механизмы.Адресация__БезОбъектов(), "А1БСП_Общее");
КонецФункции
