Функция ДобавитьМеханизмы(СписокМеханизмов) Экспорт
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1БСП_ПодключаемыеКоманды"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1БСП_ИнтерактивнаяСменаПароля"));
	СписокМеханизмов.Добавить(А1Э_Механизмы.Создать("А1БСП_ДополнительныеРеквизиты"));
КонецФункции

Функция ДобавитьОбъекты(СписокОбъектов) Экспорт
	А1Э_Механизмы.ДобавитьКОбъектам(СписокОбъектов, А1Э_Механизмы.Адресация__БезОбъектов(), "А1БСП_ИнтерактивнаяСменаПароля");
КонецФункции
