Функция ДобавитьМеханизмы(СписокМеханизмов) Экспорт
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ПодключаемыеКоманды");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ИсторияИзменений");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ДополнительныеРеквизиты");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ФиксированныеДополнительныеРеквизиты", "А1БСП_ДополнительныеРеквизиты", "Фиксированные__");
	
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ИнтерактивнаяСменаПароля");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_ОбъектыБезМеханизмов");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_Общее");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_Пользователи");
	А1Э_Механизмы.Добавить(СписокМеханизмов, "А1БСП_НаборыДополнительныхРеквизитовИСведений");
КонецФункции

Функция ДобавитьОбъекты(СписокОбъектов) Экспорт
	А1Э_Механизмы.ПодключитьБезПривязки(СписокОбъектов, "А1БСП_ИнтерактивнаяСменаПароля");
	А1Э_Механизмы.ПодключитьБезПривязки(СписокОбъектов, "А1БСП_ОбъектыБезМеханизмов");
	А1Э_Механизмы.ПодключитьБезПривязки(СписокОбъектов, "А1БСП_Общее");
	
	А1Э_Механизмы.Подключить(СписокОбъектов, "Справочник.Пользователи", "А1БСП_Пользователи");
	А1Э_Механизмы.Подключить(СписокОбъектов, "Справочник.НаборыДополнительныхРеквизитовИСведений", "А1БСП_НаборыДополнительныхРеквизитовИСведений");
КонецФункции
