Функция НастройкиМеханизма() Экспорт
	Настройки = А1Э_Механизмы.НовыйНастройкиМеханизма();
	
	Настройки.Обработчики.Вставить("ФормаПриСозданииОбъектов", Истина);
	Настройки.Обработчики.Вставить("ПередЗаписью", Истина);
	
	Настройки.ПорядокВыполнения = 10000000000000000;
	
	Возврат Настройки;
КонецФункции

#Если НЕ Клиент Тогда
	
	Функция ФормаПриСозданииОбъектов(Форма, Отказ, МассивОписаний) Экспорт
		Если НЕ А1Э_Общее.РавноОдномуИз(А1Э_Формы.ТипФормы(Форма), "ФормаЭлемента", "ФормаСписка") Тогда Возврат Неопределено; КонецЕсли;
		Если НЕ ВерсионированиеВключено(Форма) Тогда Возврат Неопределено; КонецЕсли;
		
		А1Э_Формы.ДобавитьОписаниеКомандыИКнопки2(МассивОписаний, "А1БСП_ИсторияИзменений_Показать", ИмяМодуля() + ".Показать", "ПоказатьИсториюИзменений", А1Э_Формы.КоманднаяПанель(Форма), , А1Э_Структуры.Создать(
		"Отображение", ОтображениеКнопки.Картинка,
		"Картинка", БиблиотекаКартинок.ИсторияДанных,
		))	
	КонецФункции
	
	Функция ПередЗаписью(Объект, Отказ, РежимЗаписи = Неопределено, РежимПроведения = Неопределено) Экспорт 
		Если НЕ ВерсионированиеОбъектов.ВключеноВерсионированиеОбъекта(Объект.Метаданные().ПолноеИмя()) Тогда Возврат Неопределено; КонецЕсли;
		
		Если А1Э_Метаданные.ТипМетаданных(Объект.Метаданные()) = "Документ" Тогда
			ВерсионированиеОбъектовСобытия.ЗаписатьВерсиюДокумента(Объект, Отказ, РежимЗаписи, РежимПроведения);
		Иначе
			ВерсионированиеОбъектовСобытия.ЗаписатьВерсиюОбъекта(Объект, Отказ);
		КонецЕсли;
	КонецФункции
	
	Функция ВерсионированиеВключено(Форма) Экспорт 
		ИмяМетаданных = А1Э_Формы.ИмяМетаданныхВладельцаФормы(Форма);
		Возврат ВерсионированиеОбъектов.ВключеноВерсионированиеОбъекта(ИмяМетаданных);
	КонецФункции

#КонецЕсли
#Если Клиент Тогда
	
	Функция Показать(Форма, Команда) Экспорт 
		ОткрытьФорму("РегистрСведений.ВерсииОбъектов.Форма.ВыборХранимыхВерсий", А1Э_Структуры.Создать(
		"Ссылка", А1Э_Формы.ТекущаяСсылка(Форма),
		), , , , , , РежимОткрытияОкнаФормы.Независимый);		
	КонецФункции
	
#КонецЕсли

Функция ИмяМодуля() Экспорт
	Возврат "А1БСП_ИсторияИзменений";	
КонецФункции


