
&После("ВыполнитьКоманду")
Процедура А1БСП_ВыполнитьКоманду(Форма, Элемент, СтандартнаяОбработка)
	Если ТипЗнч(Элемент) <> Тип("КомандаФормы") Тогда Возврат; КонецЕсли;
	
	Если Элемент.Имя = "А1БСП_ДобавитьРеквизит" Тогда
		ПоложениеВторойТочки = СтрНайти(Форма.ИмяФормы, ".", , , 2);
		ИмяНабора = СтрЗаменить(Лев(Форма.ИмяФормы, ПоложениеВторойТочки - 1), ".", "_"); 
		ТекущийНабор = ПредопределенноеЗначение("Справочник.НаборыДополнительныхРеквизитовИСведений." + ИмяНабора);
		
		ПараметрыФормы = Новый Структура;
		ПараметрыФормы.Вставить("НаборСвойств", ТекущийНабор);
		ПараметрыФормы.Вставить("ЭтоДополнительноеСведение", Ложь);
		ПараметрыФормы.Вставить("ТекущийНаборСвойств", ТекущийНабор);
		
		ОткрываемаяФорма = "ПланВидовХарактеристик.ДополнительныеРеквизитыИСведения.ФормаОбъекта";
		ОткрытьФорму(ОткрываемаяФорма, ПараметрыФормы);
	КонецЕсли;
КонецПроцедуры
