#Если Клиент Тогда
	
	Функция Открыть(СсылкаНаФайл) Экспорт
		Попытка
			ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(СсылкаНаФайл);
			РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
		Исключение
			//Почему-то иногда типовой механизм при первой попытке открытия файла выдает странную ошибку. При повторных открытиях файла ошибки не происходит.
			//ТУДУ: расследовать, понять что по факту происходит.
			//На сейчас просто попытаемся повторить операцию.
			ДанныеФайла = РаботаСФайламиКлиент.ДанныеФайла(СсылкаНаФайл);
			РаботаСФайламиКлиент.ОткрытьФайл(ДанныеФайла);
		КонецПопытки;
	КонецФункции
	
#КонецЕсли
 